[
  {
    "state": "Alaska",
    "code": "AK",
    "modules": [
      {"name": "Statewide", "id": "alaska", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "Districts in Alaksa",
        "nav": "Districts",
        "pages": ["alaska"],
        "type": "text",
        "content": "<p>Alaska currently has 1 at-large congressional district. Their State Legislature has 20 state Senate districts and 40 state House districts. These districts are nested, where each state Senate district contains two state House districts. Alaska has a particularly high percentage of unprecincted votes, coming from sources such as early and absentee ballots that accounted for a third of all ballots cast in the 2018 US House of Representatives and state Governor elections.</p>"
      },
      {
        "name": "Redistricting Rules in Alaska",
        "nav": "Rules",
        "pages": ["alaska"],
        "type": "text",
        "content": "<p>The Voting Rights Act of 1965 requires that minority groups have the ability to elect their chosen candidate where possible. It is particularly significant in Alaska due to the large rural Native Alaskan population.</p><p>An amendment was made to the Alaskan state Constitution in 1998 that created a five-member Alaska Redistricting Board to oversee the redistricting process after each Decennial census. Three out of the five members must approve of the redistricting plan in order for it to be enacted. The state constitution requires House districts to be: <blockquote>“contiguous and compact territory containing as nearly as practicable a relatively integrated socio-economic area.... [and] contain[ing] a population as near as practicable to the quotient obtained by dividing the population of the state by forty…”</blockquote>and requires Senate districts to be: <blockquote>“...composed as near as practicable of two contiguous house districts”.</blockquote></p><p>The rules on whether or not water bodies violate district contiguity are vague.</p>"
      },
      {
        "name": "Research Context",
        "nav": "Research",
        "pages": ["alaska"],
        "type": "text",
        "content": "<p>This module was created as part of the research process for MGGG's paper on Alaska, <a href=\"https://mggg.org/alaska\">Mathematics of Nested Districts: The Case of Alaska</a>.  The report investigates the possibility of a gerrymander that pairs nested House districts for Senate districts to favor Republicans, since Democrats control the House but the Senate has a ⅔ Republican majority. It was ultimately determined that there was a Republican skew in the enacted plans for the Senate when compared to all the possible plans that would fit the necessary criteria. This partisan sway is equivalent to that of a plan made from scratch. Choices in how to determine contiguity rules when it comes to bodies of water and how to distribute the high number of unprecincted votes can have significant sway on partisan results as well. </p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["alaska"],
        "content": "<p>The units used here are <strong>voting precincts</strong>. Data for this module were obtained from the Alaska Division of Elections and from National Historic GIS (NHGIS). The precinct shapefile and election results were downloaded <a href=\"http://www.elections.alaska.gov/Core/electionresources.php\">from the Alaska Division of Elections</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from <a href=\"https://www.nhgis.org\">NHGIS</a>. The source shapefile for this module, along with additional information about processing, is available for download from MGGG's GitHub organization <a href=\"https://github.com/mggg-states/AK-shapefiles\">@mggg-states</a>.</p>"
      }
    ]
  },
  {
    "state": "Arizona",
    "code": "AZ",
    "modules": [
      {"name": "Arizona", "id": "arizona", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["arizona"],
        "content": "<p>The units you see here are <strong>precincts</strong>.</p><p>The precinct shapefile is made available on <a href=\"https://www.kaggle.com/azsecretaryofstate/arizona-statewide-precinct-shapefile?select=az_vtd_2018_new_pima.shp\">Kaggle</a> by Garret Archer, formerly Senior Elections Analyst with the Arizona Secratary of State and currently a Data Analyst with ABC15 Arizona. Tabular election data are from the <a href=\"https://electionlab.mit.edu/\">MIT Election Data Science Lab</a>. Block level demographic data for the 2010 Decennial Census were retrieved using the <a href=\"https://api.census.gov/data/2010/dec/sf1\">Census API</a>. Processing was completed by members of the Metric Geometry and Gerrymandering Group (MGGG).</p><p>Some very limited merging of precincts in the original shapefile was necessary to join election results. La Paz County precincts were edited to match data provided on the county's <a href=\"http://www.co.la-paz.az.us/DocumentCenter/View/76/Precinct-Map-PDF\">election website</a>.</p>"
      }
    ]
  },
  {
    "state": "Arkansas",
    "code": "AK",
    "modules": [
      {"name": "Little Rock", "id": "little_rock", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["little_rock"],
        "content": "<p>The units you see here are <strong>census blocks</strong>. Data for this module were obtained from the US Census Bureau. The block shapefile for the City of Little Rock was downloaded from the Census <a href=\"https://www.census.gov/geo/maps-data/data/tiger-line.html\">TIGER/Line Shapefiles</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from <a href=\"https://factfinder.census.gov/faces/nav/jsf/pages/index.xhtml\">American FactFinder</a>.</p>"
      }
    ]
  },
  {
    "state": "California",
    "code": "CA",
    "modules": [
      {"name": "Napa", "id": "napa", "default": "true"},
      {"name": "Napa Valley Schools", "id": "napaschools"},
      {"name": "Santa Clara", "id": "santa_clara"},
      {"name": "Ontario", "id": "ontarioca"}
    ],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "Election reform in Napa",
        "nav": "Election Reform",
        "pages": ["napa"],
        "type":"text",
        "content": "<p>The City of Napa is switching from electing city council seats at-large,to individual districts each with one or more members.</p><p>This districting process should be open and transparent for everyone, and the chosen district should represent neighborhoods and communities.</p>"
      },
      {
        "name": "Election reform in Napa",
        "nav": "Election Reform",
        "pages": ["napaschools"],
        "type":"text",
        "content": "<p>The Napa Valley Unified School District is considering switching from electing the Board of Education trustees at-large, to seven districts each with one member.</p><p>This districting process should be open and transparent for everyone, and the chosen district should represent neighborhoods and communities.</p>"
      },
      {
        "name": "Election reform in Santa Clara",
        "nav": "Election Reform",
        "type": "text",
        "pages": ["santa_clara"],
        "content": "<p>This module was created because of a lawsuit against Santa Clara's at-large electoral system for City Council, which plaintiffs claim posed a structural impediment to the election of Asian Americans. A district court in May 2018 ruled that the voting system violated the California Voting Rights Act (for more information see <a href=\"https://www.nbcbayarea.com/news/local/Court-Rules-Santa-Clara-Violated-the-California-Voting-Rights-Act-482815201.html\">here</a>. In February 2018, MGGG <a href=\"https://mggg.org/SantaClara.pdf\">released a report</a> with recommendations for alternative voting systems in Santa Clara.</p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["napa", "napaschools"],
        "content": "<p>The units you see here are <strong>census blocks</strong>. Data for this module were obtained from the US Census Bureau. The block shapefile for Napa was downloaded from the Census's <a href=\"https://www.census.gov/geo/maps-data/data/tiger-line.html\">TIGER/Line Shapefiles</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from <a href=\"https://factfinder.census.gov/faces/nav/jsf/pages/index.xhtml\">American FactFinder</a> and the <a href=\"https://api.census.gov\">Census API</a>.</p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["santa_clara"],
        "content": "<p>The units you see here are <strong>census blocks</strong>. Data for this module were obtained from the US Census Bureau. The block shapefile for the City of Santa Clara was downloaded from the Census's <a href=\"https://www.census.gov/geo/maps-data/data/tiger-line.html\">TIGER/Line Shapefiles</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from <a href=\"https://factfinder.census.gov/faces/nav/jsf/pages/index.xhtml\">American FactFinder</a>. The source shapefile with demographic information is available for <a href=\"https://github.com/gerrymandr/Districtr-Prep/tree/master/Santa_Clara\">@gerrymandr</a>.</p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["ontarioca"],
        "content": "<p>The units you see here are <strong>census blocks</strong>. Data for this module were obtained from the US Census Bureau. The block shapefile for California was downloaded from the Census's <a href=\"https://www.census.gov/geo/maps-data/data/tiger-line.html\">TIGER/Line Shapefiles</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from <a href=\"https://factfinder.census.gov/faces/nav/jsf/pages/index.xhtml\">American FactFinder</a> and the <a href=\"https://api.census.gov\">Census API</a>.</p>"
      }
    ]
  },
  {
    "state": "Colorado",
    "code": "CO",
    "modules": [
      {"name": "Statewide", "id": "colorado", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "Districts in Colorado",
        "nav": "Districts",
        "pages": ["colorado"],
        "type": "text",
        "content": "<p>Colorado has 7 Congressional Districts. The Colorado state legislature consists of a 65 seat House of Representatives and a 35 seat Senate.</p>"
      },
      {
        "name": "Redistricting Rules in Colorado",
        "nav": "Rules",
        "pages": ["colorado"],
        "type": "text",
        "content": "<p>Colorado has a 12 member independent commission for drawing districts. The same commission selection and districting rules apply to congressional and state legislative redistricting. The commission consists of 4 registered with each of the 2 major parties and 4 registered with neither major party, and 6 commissioners randomly chosen by the judicial panel. Commission members cannot be compensated by public officials or hold public office. The non-partisan members of the commission are in charge of drawing the proposed districts.</p><p>State law requires that districts:<ul><li>Be contiguous and compact</li><li>Have a population deviation of less than 5%</li><li>Preserve communities of interest and political subdivisions</li><li>Maximize number of competitive districts after adhering to other criteria</li><li>Not be drawn to favor incumbents or certain political parties</li><li>Not interfere with the ability of a racial or language minority group to elect a candidate of choice</li></ul>State legislative districts must additionally preserve political boundaries wherever possible and be as compact as possible given their total perimeter.</p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["colorado"],
        "content": "<p>The units used here are <strong>precincts</strong>. </p><p>This shapefile comes from Todd Bleess of the Colorado State Demographer's Office and was cleaned and processed by members of Beth Malmskog's team at Colorado College. This effort was led by Haley Colgate and included Austin Eide, Matt Cooney, Edgar Santos Vega, Kadin Mangalik, and Jose Monge Castro. Some additional processing was done by MGGG staff.</p><p>The 2018 Colorado precinct shapefile was made available to us by Todd Bleess of the Colorado State Demographer's Office. Election data come from the <a href=\"https://www.sos.state.co.us/pubs/elections/Results/Archives.html\">Colorado Secretary of State's Office</a>. 2010 Decennial Census demographic data were downloaded from the <a href=\"https://api.census.gov/data/2010/dec/sf1\">Census API</a>. The 2010 census block shapefile for Minnesota was downloaded from the US Census Bureau’s <a href=\"https://www.census.gov/geographies/mapping-files/time-series/geo/tiger-line-file.html\">TIGER/Line Shapefiles</a>.</p><p>Precincts for certain counties were not included in the shapefile provided by the Demographer's Office and were digitized from maps provided by the county. Those counties are: Boulder, Denver, Douglas, and El Paso. For Las Animas county, the voter file was geocoded and used to identify precinct boundaries. Demographic data were aggregated from the census block level and precincts were assigned to districts using <a href=\"https://github.com/mggg/maup\">MGGG's proration software</a>.</p>"
      }
    ]
  },
  {
    "state": "Connecticut",
    "code": "CT",
    "modules": [
      {"name": "Statewide", "id": "connecticut", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "Districts in Connecticut",
        "nav": "Districts",
        "pages": ["connecticut"],
        "type": "text",
        "content": "<p>Connecticut has 5 Congressional districts. The State legislature consists of a House of Representatives with 151 members and a Senate with 36 members.</p>"
      },
      {
        "name": "Redistricting Rules in Connecticut",
        "nav": "Rules",
        "pages": ["connecticut"],
        "type": "text",
        "content": "<p>Connecticut has a Reapportionment Committee for drawing districts. There are no state-level criteria for Congressional districts, but state legislative districts must be contiguous and keep town boundaries intact as much as possible.</p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["connecticut"],
        "content": "<p>The units you see here are <strong>precincts</strong>.</p><p> Raw data for Connecticut's voting district boundaries was sourced from election and other town officials and processed by members of the MGGG Redistricting Lab. Precinct-level election results were obtained from the Connecticut Secretary of State's Election Center.</p><p> Block level demographic data for the 2010 Decennial Census were retrieved using the <a href=\"https://api.census.gov/data/2010/dec/sf1\">Census API</a>.  Demographic data were aggregated from the census block level and voting districts were assigned to districts using <a href=\"https://github.com/mggg/maup\">MGGG's proration software</a>.</p>"
      }
    ]
  },
  {
    "state": "Florida",
    "code": "FL",
    "modules": [
      {"name": "Miami-Dade County", "id": "miamidade", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["miamidade"],
        "content": "<p>The units you see here are <strong>census block groups</strong>. Data for this module were obtained from the US Census Bureau. The shapefile for Miami-Dade county was downloaded from the Census's <a href=\"https://www.census.gov/geo/maps-data/data/tiger-line.html\">TIGER/Line Shapefiles</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from the <a href=\"https://api.census.gov\">Census API</a>.</p>"
      }
    ]
  },
  {
    "state": "Georgia",
    "code": "GA",
    "modules": [
      {"name": "Statewide", "id": "georgia", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["georgia"],
        "content": "<p>The units you see here are <strong>precincts</strong>. Data for this module were obtained from the Georgia General Assembly Legislative and Congressional Reapportionment Office, the MIT Elections Data and Science Lab (MEDSL), and National Historic GIS (NHGIS). The precinct shapefile for Georgia was downloaded from the Georgia General Assembly Legislative and Congressional Reapportionment Office's <a href=\"http://www.legis.ga.gov/Joint/reapportionment/en-US/default.aspx\">website</a> and 2016 election results were downloaded from the <a href=\"https://github.com/MEDSL/official-precinct-returns\">MEDSL</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from <a href=\"https://www.nhgis.org\">NHGIS</a>. The source shapefile for this module, along with additional information about processing, is available for download from MGGG's GitHub organization <a href=\"https://github.com/mggg-states/GA-shapefiles\">@mggg-states</a>.</p>"
      }
    ]
  },
  {
    "state": "Hawaii",
    "code": "HI",
    "modules": [
      {"name": "Statewide", "id": "hawaii", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["hawaii"],
        "content": "<p>The units you see here are <strong>precincts</strong>.</p><p>This shapefile comes from Hawaii Statewide GIS Program and was processed by Metric Geometry and Gerrymandering Group (MGGG) staff.</p><p>This precinct shapefile comes from the <a href=\"http://planning.hawaii.gov/gis/download-gis-data/\">Hawaii Statewide GIS Program</a> in the State Office of Planning. Election results come from the <a href=\"https://elections.hawaii.gov/election-results/\">State of Hawaii Office of Elections</a>. 2010 Decennial Census demographic data were downloaded from the <a href=\"https://api.census.gov/data/2010/dec/sf1\">Census API</a>. The 2010 census block shapefile for Hawaii was downloaded from the US Census Bureau’s <a href=\"https://www.census.gov/geographies/mapping-files/time-series/geo/tiger-line-file.html\">TIGER/Line Shapefiles</a>.</p><p>Precincts 41-02 and 41-05 were merged as were precincts 42-01 and 42-04 in order to join 2016 and 2018 results onto the same precinct boundaries. Demographic data were aggregated from the block level using <a href=\"https://github.com/mggg/maup\">MGGG’s proration software</a>.</p>"
      }
    ]
  },
  {
    "state": "Illinois",
    "code": "IL",
    "modules": [
      {"name": "Chicago", "id": "chicago", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "Community Areas",
        "nav": "Community Areas",
        "type": "text",
        "pages": ["chicago"],
        "content": "<p>The demographic makeup of Chicago is split roughly in thirds between Hispanic, Black, and White racial/ethnic groups. The city is made up of 77 community areas that have played an important role in city planning and culture since their inception by researchers at the University of Chicago in the 1920s. The community areas, and the city more generally, are highly segregated. Black populations are the most densely clustered in the city, but the Black percentage as a total share of the population has been decreasing in recent decades.</p>"
      },
      {
        "name": "Chicago City Council",
        "nav": "City Council",
        "type": "text",
        "pages": ["chicago"],
        "content": "<p>The Chicago City Council is composed of 50 elected officials known as aldermen. Each alderman is elected by and represents a single-member district of the city known as a ward. The current ward plan in Chicago is widely criticized for being gerrymandered, with districts of vastly uneven population distributions, illogical shapes, heightened segregation, and unfair favor towards incumbents. There is also some argument that the 50-member city council is inefficiently large. Due to the high levels of segregation in the city, the current wards tend to be dominated by one racial/ethnic group with an alderman nearly always coming from that dominant group. Latinos are the most underrepresented group, with only 22% representation in the city council despite making up 29% of the population.</p>"
      },
      {
        "name": "Research Context",
        "nav": "Research",
        "type": "text",
        "pages": ["chicago"],
        "content": "<p>This module was created as part of <a href=\"https://mggg.org\">MGGG</a>'s <a href=\"https://mggg.org/Chicago.pdf\">Study of Reform Proposals for Chicago City Council</a>. We set out to explore how different districts, or moving to multi-member districts, might impact representation and better promote a fair and responsive city government.  The report considered the following reform methods: <ul><li>Redrawing the lines in the current 50-ward system</li><li>Shrinking the city council from 50 members to 30 or fewer</li><li>Moving from single-member districts to multi-member districts</li><li>Moving from plurality elections to ranked choice voting</li></ul></p><p><a href=\"https://mggg.org/posts/chicago\">You can read more background and access the report here.</a></p>"
      },
      {
        "name": "See the plans featured in the report",
        "nav": "Featured Plans",
        "pages": ["chicago"],
        "type": "plans",
        "ref": "chicago",
        "disc": "Click on any of the districting plans below to open it in Districtr. Then feel free to start modifying it yourself!",
        "postscript": "<dl class=\"dfn-list\"><div class=\"dfn-list__row\"><dt class=\"dfn-list__term\">Concentrated poverty</dt><dd class=\"dfn-list__caption\">&ge; 25% of households under $20K annual income</dd></div><div class=\"dfn-list__row\"><dt class=\"dfn-list__term\">Concentrated wealth</dt><dd class=\"dfn-list__caption\">&ge; 25% of households over $150K annual income</dd></div><div class=\"dfn-list__row\"><dt class=\"dfn-list__term\">Segregated</dt><dd class=\"dfn-list__caption\">only one racial group exceeds 1/4 of population</dd></div><div class=\"dfn-list__row\"><dt class=\"dfn-list__term\">Hypersegregated</dt><dd class=\"dfn-list__caption\">only one racial group exceeds 1/6 of population</dd></div><div class=\"dfn-list__row\"><dt class=\"dfn-list__term\">Highly diverse</dt><dd class=\"dfn-list__caption\">three racial groups exceed 1/4 of population</dd></div></dl>",
        "plans": [
          {
            "title": "Current enacted plan",
            "plans": [
              {
                "id": "current-wards",
                "name": "Current Enacted Plan",
                "numbers": [
                    { "number": 46, "caption": "wards with a majority race" },
                    { "number": 38, "caption": "segregated wards" },
                    { "number": 19, "caption": "hypersegregated wards" },
                    { "number": 19, "caption": "wards with concentrated poverty" },
                    { "number": 13, "caption": "wards with concentrated wealth" }
                ]
              }
            ]
          },
          {
            "title": "50 single-member wards built out of precincts",
            "plans": [
              {
                "id": "prec50-6084",
                "name": "Plan #6084",
                "numbers": [
                  {
                    "number": 26,
                    "caption": "segregated wards (fewest)"
                  }
                ]
              },
              {
                "id": "prec50-12816",
                "name": "Plan #12816",
                "description": "Most economic parity",
                "numbers": [
                  {
                    "number": 13,
                    "caption": "wards with concentrated poverty (fewest)"
                  },
                  {
                    "number": 5,
                    "caption": "wards with concentrated wealth"
                  }
                ]
              },
              {
                "id": "prec50-55139",
                "name": "Plan #55139",
                "numbers": [
                  {
                    "number": 34,
                    "caption": "wards with a majority race (fewest)"
                  }
                ]
              }
            ]
          },
          {
            "title": "10 multi-member wards built out of precincts",
            "plans": [
              {
                "id": "prec10-205",
                "name": "Plan #205",
                "description": "Most economic parity",
                "numbers": [
                  { "number": 1, "caption": "ward with concentrated poverty" },
                  { "number": 0, "caption": "wards with concentrated wealth" }
                ]
              },
              {
                "id": "prec10-8178",
                "name": "Plan #8178",
                "numbers": [
                  {
                    "number": 0,
                    "caption": "hypersegregated wards"
                  }
                ]
              },
              {
                "id": "prec10-8698",
                "name": "Plan #8698",
                "numbers": [
                  {
                    "number": 3,
                    "caption": "wards with a majority race (fewest)"
                  }
                ]
              },
              {
                "id": "prec10-55213",
                "name": "Plan #55213",
                "numbers": [
                  {
                    "number": 6,
                    "caption": "highly diverse wards (most)"
                  }
                ]
              }
            ]
          },
          {
            "title": "10 multi-member wards built out of community areas",
            "plans": [
              {
                "id": "ca10-937",
                "name": "Plan #937",
                "numbers": [
                  {
                    "number": 0,
                    "caption": "hypersegregated wards"
                  }
                ]
              },
              {
                "id": "ca10-1042",
                "name": "Plan #1042",
                "numbers": [
                  {
                    "number": 3,
                    "caption": "wards with a majority race (fewest)"
                  }
                ]
              },
              {
                "id": "ca10-5848",
                "name": "Plan #5848",
                "description": "Most economic parity",
                "numbers": [
                  { "number": 1, "caption": "ward with concentrated poverty" },
                  { "number": 0, "caption": "wards with concentrated wealth" }
                ]
              },
              {
                "id": "ca10-25218",
                "name": "Plan #25218",
                "numbers": [
                  {
                    "number": 6,
                    "caption": "highly diverse wards (most)"
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["chicago"],
        "content": "<p>The units used in these modules are <strong>precincts</strong> and Chicago's <a href=\"https://en.wikipedia.org/wiki/Community_areas_in_Chicago\">community areas</a>, which were drawn by social scientists at UChicago in the 1920s and serve as proxies for neighborhoods. Data for this module were obtained the City of Chicago Data Portal and from the US Census Bureau. The precinct and community area shapefiles were downloaded from the <a href=\"https://data.cityofchicago.org/Facilities-Geographic-Boundaries/Boundaries-Community-Areas-current-/cauq-8yn6\">Chicago Data Portal</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from <a href=\"https://factfinder.census.gov/faces/nav/jsf/pages/index.xhtml\">American FactFinder</a>. The source shapefiles with demographic information are available for download from <a href=\"https://github.com/mggg/chicago/tree/master/shapefiles\">MGGG's GitHub organization</a>.</p>"
      }
    ]
  },
  {
    "state": "Iowa",
    "code": "IA",
    "modules": [
      {"name": "Statewide", "id": "iowa", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["iowa"],
        "content": "<p>The units used here are <strong>counties</strong>. Iowa has strict laws requiring that congressional districts be built out of counties. The county shapefile comes from the US Census Bureau's <a href=\"https://www.census.gov/geo/maps-data/data/tiger-line.html\">TIGER/Line Shapefiles</a>. 2010 Decennial Census demographic data were downloaded from <a href=\"https://factfinder.census.gov/faces/nav/jsf/pages/index.xhtml\">American FactFinder</a>. County level election data for presidential elections since 2000 were obtained from the <a href=\"https://github.com/MEDSL/official-precinct-returns\">MIT Elections Data and Science Lab</a>. The source shapefile for this module, along with additional informationabout processing, is available for download from MGGG's GitHub organization <a href=\"https://github.com/mggg-states/IA-shapefiles\">@mggg-states</a>.</p>"
      }
    ]
  },
  {
    "state": "Maryland",
    "code": "MD",
    "modules": [
      {"name": "Statewide", "id": "maryland", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "Districts in Maryland",
        "nav": "Districts",
        "type": "text",
        "pages": ["maryland"],
        "content": "<p>Maryland has 8 Congressional districts. The state legislature consists of a House of Representatives with 141 members and a Senate with 47 members. State house districts are nested with Senate districts, with 3 and 1 members respectively.</p>"
      },
      {
        "name": "Redistricting Rules in Maryland",
        "nav": "Rules",
        "type": "text",
        "pages": ["maryland"],
        "content": "<p>The state legislature draws congressional districting plans, while either the governor or the state legislature can draw and present state legislature districting plans. There are no specific criteria for congressional plans, but state legislature plans must honor compactness, contiguity, and give “due regard” to natural and political boundaries.</p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["maryland"],
        "content": "<p>The units you see here are <strong>precincts</strong>.</p><p>This shapefile was obtained from the Maryland Department of Planning website and processed by members of the Metric Geometry and Gerrymandering Group (MGGG).</p><p>The Maryland precinct shapefile was obtained from the <a href=\"https://planning.maryland.gov/Redistricting/Pages/2010/precinct.aspx\">Maryland Department of Planning's Redistricting website</a>. Election data come from the <a href=\"https://elections.maryland.gov/elections/2018/election_data/index.html\">Maryland State Board of Elections</a>. It is important to note that Maryland only releases election day ballots cast at the precinct level and the election results here do not include early, absentee or provisional votes.</p><p>Statewide election returns from the Board of Elections were cleaned by MGGG staff in order to join them to the precinct shapefile. Ceratin precincts in the shapefile and in the results were merged in order to reconcile discrepencies. Demographic data was aggregated from the block level using <a href=\"https://github.com/mggg/maup\">MGGG’s proration software</a>. Congressional and state legislative district IDs were assigned to precincts also using this package.</p>"
      }
    ]
  },
  {
    "state": "Massachusetts",
    "code": "MA",
    "modules": [
      {"name": "Statewide", "id": "ma", "default": "true"},
      {"name": "Lowell", "id": "lowell"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "Election reform in Lowell",
        "nav": "Election Reform",
        "pages": ["lowell"],
        "type": "text",
        "content": "<p>In 2019, all eyes are on Lowell, Massachusetts. The City of Lowell’s at-large electoral system has been challenged in a recent lawsuit (Huot et al. v. City of Lowell et al). Plaintiffs in the case argued that the current system dilutes the votes of Lowell's communities of color for the City Council and School Board. For more information about the lawsuit, read LCR's explainer <a href=\"https://www.lawyerscom.org/wp-content/uploads/2010/08/Lowell-Voting-Rights-Lawsuit-FAQ-Final.pdf\">[here]</a>.</p><p>  This November, Lowell residents will have a chance to vote on a new system! The choices for City Council are (a) a city-wide system electing 9 council members by ranked choice, or (b) 8 districts plus 3 at-large seats, raising the size of the council to 11 members.</p><p> Read our <a href=\"https://mggg.org/Lowell-Report\">public report</a> on the choice facing Lowell voters this November!  We explain the options on the ballot and some general differences between systems of election.  For more technical explanations of our modeling, refer to our <a href=\"https://mggg.org/Lowell-Detailed-Report\">detailed report</a>.</p> <p> Versions of the public report are also available in <a href=\"https://mggg.org/Lowell-Report/sp\">Spanish</a>,  <a href=\"https://mggg.org/Lowell-Report/pt\">Portuguese</a>, and  <a href=\"https://mggg.org/Lowell-Report/kh\">Cambodian Khmer</a>.</p>"
      },
      {
        "name": "See randomly constructed plans",
        "nav": "Sample Plans",
        "pages": ["lowell"],
        "type": "plans",
        "ref": "lowell",
        "disc": "Click on any of the districting plans below to open it in Districtr. Then feel free to start modifying it yourself! Each of these plans was generated by randomized algorithms, while making sure that the Asian and Latino communities meet the statistical thresholds laid out in the legal requirements, where applicable.",
        "plans": [
          {
            "title": "Sample valid 3-district plans",
            "plans": [
                {
                  "id": "plan3a",
                  "name": "Random Plan 3A"
                },
                {
                  "id": "plan3b",
                  "name": "Random Plan 3B"
                }]
          },
          {
            "title": "Sample valid 7-district plans",
            "plans": [
              {
                "id": "plan7a",
                "name": "Random Plan 7A"
              },
              {
                "id": "plan7b",
                "name": "Random Plan 7B"
              }]
          },
          {
            "title": "Sample valid 8-district plans (Option on the Ballot)",
            "plans": [
              {
                "id": "plan8a",
                "name": "Random Plan 8A"
              },
              {
                "id": "plan8b",
                "name": "Random Plan 8B"
              }]
          },
          {
            "title": "Sample valid 9-district plans",
            "plans": [
              {
                "id": "plan9a",
                "name": "Random Plan 9A"
              },
              {
                "id": "plan9b",
                "name": "Random Plan 9B"
              }]
          }
        ]
      },
      {
        "name": "Districts in Massachusetts",
        "nav": "Districts",
        "type": "text",
        "pages": ["ma"],
        "content": "<p>Massachusetts has a bicameral state legislature consisting of 160 House members and 40 Senate members. For the US House of Representatives, Massachusetts has 9 congressional districts.</p>"
      },
      {
        "name": "Redistricting Rules in Massachusetts",
        "nav": "Rules",
        "type": "text",
        "pages": ["ma"],
        "content": "<p>The state legislature is in charge of drawing districts. There are no specific criteria for Congressional districts, but state legislative districts:<ul><li>Require contiguity</li><li>Must follow political boundaries</li><li>Can be vetoed by the governor</li><li>Senate requires single-member districts</li></ul></p>"
      },
      {
        "name": "Research Context",
        "nav": "Research",
        "type": "text",
        "pages": ["ma"],
        "content": "<p>These modules were created to aid in a paper, <a href=\"https://arxiv.org/abs/1810.09051\"> \"Locating the representational baseline: Republicans in Massachusetts,\"</a> written by MGGG and collaborators. Despite Republicans usually gaining between 30% and 40% of the two-way vote share in statewide elections, Massachusetts has not elected a Republican to the US House of Representatives since 1994. The paper finds that the underperformance of Republicans in Massachusetts is not the result of gerrymandering or candidate availability, but rather is a factor of the spatial distribution of Republican voters in the state.</p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["ma"],
        "content": "<p>The units you see here are <strong>precincts</strong> from the 2000 redistricting cycle, <strong>precincts</strong> from the 2010 redistricting cycle, and Massachusetts' <strong>towns and municipalities</strong></p><p>The 2002-2010 raw, unprocessed shapefile comes <a href=\"https://catalog.data.gov/dataset/tiger-line-shapefile-2012-2010-state-massachusetts-2010-census-voting-district-state-based-vtd\">from the United States Census Bureau</a> and was sent to MGGG by Secretary of the Commonwealth Francis Galvin's office.  The 2012-2016 raw, unprocessed precinct shapefile comes from the office of the Secretary of the Commonwealth of Massachusetts, William Francis Galvin.  The town shapefile was downloaded from the <a href=\"https://docs.digital.mass.gov/dataset/massgis-data-community-boundaries-towns-survey-points\">Massachusetts Bureau of Geographic Information website</a>.  All election data comes from the Secretary of the Commonwealth's <a href=\"http://electionstats.state.ma.us\">Elections Division website</a>.</p><p>The source precinct shapefiles for these modules, along with additional information about processing, is available for download from MGGG's GitHub organization <a href=\"https://github.com/mggg-states/MA-shapefiles\">@mggg-states</a>.</p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["lowell"],
        "content": "<p> The units you see here are <strong>census blocks</strong>. Data for this module were obtained from the US Census Bureau. The block shapefile for the City of Lowell was downloaded from the Census <a href=\"https://www.census.gov/geo/maps-data/data/tiger-line.html\">TIGER/Line Shapefiles</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from <a href=\"https://factfinder.census.gov/faces/nav/jsf/pages/index.xhtml\">American FactFinder</a>. The source shapefile with demographic information is available for download from MGGG's GitHub organization <a href=\"https://github.com/gerrymandr/Districtr-Prep/tree/master/Lowell\">@gerrymandr</a>.</p>"
      }
    ]
  },
  {
    "state": "Michigan",
    "code": "MI",
    "modules": [
      {"name": "Statewide", "id": "michigan", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "Districts in Michigan",
        "nav": "Districts",
        "type": "text",
        "pages": ["michigan"],
        "content": "<p>Michigan currently has 14 Congressional districts. The state legislature consists of a House of Representatives with 110 members and a Senate with 38 members.</p>"
      },
      {
        "name": "Redistricting Rules in Michigan",
        "nav": "Rules",
        "type": "text",
        "pages": ["michigan"],
        "content": "<p>Michigan has an independent commission for drawing districts. The commission has 13 members, with 4 for each major party (Democrat and Republican) and 5 unaffiliated or affiliated with a minor party. Commission members may not hold public office or associated positions such as lobbyists and state employees. The commission requires an 8 vote majority to pass a plan, after which members must rank each plan and the highest ranked is submitted.</p><p>For both congressional and state legislative districts, Michigan requires that districts:<ul><li>Be contiguous and compact</li><li>Accurately represent the state’s diversity and communities of interest</li><li>Respect political boundaries wherever possible</li><li>Do not lend advantage or disadvantage to any party, incumbent, or candidate</li><li>Stay within a 2% population deviation</li></ul></p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["michigan"],
        "content": "<p>The units used here are <strong>precincts</strong>. The precinct and congressional district shapefiles come from the Michigan Department of State through the <a href=\"http://gis-michigan.opendata.arcgis.com/datasets/2016-voting-precincts\">State of Michigan GIS Open Data Portal</a>. Demographic data at the block level are from <a href=\"https://www.nhgis.org/\">IPUMS NHGIS</a>. Shapefiles for Michigan's state house and senate districts were downloaded from the US Census Bureau's <a href=\"https://www.census.gov/cgi-bin/geo/shapefiles/index.php\">TIGER/Line Program</a>. Precinct level election data for 2016 were obtained from the <a href=\"https://electionlab.mit.edu\">MIT Elections Data and Science Lab</a>. The source shapefile for this module, along with additional information about processing, is available for download from MGGG's GitHub organization <a href=\"https://github.com/mggg-states/MI-shapefiles\">@mggg-states</a>.</p>"
      }
    ]
  },
  {
    "state": "Minnesota",
    "code": "MN",
    "modules": [
      {"name": "Statewide", "id": "minnesota", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["minnesota"],
        "content": "<p>The units used here are <strong>precincts</strong>. The Minnesota precinct shapefiles with election results were created by the <a href=\"https://www.sos.state.mn.us/elections-voting/\">Minnesota Secretary of State Election Division</a> and obtained from the <a href=\"https://www.gis.leg.mn/html/download.html\">Minnesota LCC-GIS</a>. 2010 Decennial Census demographic data were downloaded from the <a href=\"https://api.census.gov/data/2010/dec/sf1\">Census API</a>. The 2010 census block shapefile for Minnesota was downloaded from the US Census Bureau’s <a href=\"https://www.census.gov/geographies/mapping-files/time-series/geo/tiger-line-file.html\">TIGER/Line Shapefiles</a>. The source shapefile for this module, along with additional information about processing, is available for download from MGGG's GitHub organization <a href=\"https://github.com/mggg-states/MN-shapefiles\">@mggg-states</a>.</p>"
      }
    ]
  },
  {
    "state": "Mississippi",
    "code": "MS",
    "modules": [
      {"name": "Statewide", "id": "mississippi", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "Research Context",
        "nav": "Research",
        "type": "text",
        "pages": ["mississippi"],
        "content": "<p>This Mississippi module comes out of a project from MGGG's Voting Rights Data Institute that explored how many majority-Black congressional districts are possible to draw. A write-up of this experiment is forthcoming.</p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["mississippi"],
        "content": "<p>The units used here are <strong>census block groups</strong>. Data for this module were obtained from the US Census Bureau. The block group shapefile for Mississippi was downloaded from the Census's <a href=\"https://www.census.gov/geo/maps-data/data/tiger-line.html\">TIGER/Line Shapefiles</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from <a href=\"https://factfinder.census.gov/faces/nav/jsf/pages/index.xhtml\">American FactFinder</a>. The source shapefile with demographic information is available for download from MGGG's GitHub organization <a href=\"https://github.com/gerrymandr/Districtr-Prep/tree/master/Mississippi\">@gerrymandr</a>.</p>"
      }
    ]
  },
  {
    "state": "Nevada",
    "code": "NV",
    "modules": [
      {"name": "Clark County", "id": "clarknv", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["clarknv"],
        "content": "<p>The units used here are <strong>census blocks</strong>. Data for this module were obtained from the US Census Bureau. The block shapefile for Nevada was downloaded from the Census's <a href=\"https://www.census.gov/geo/maps-data/data/tiger-line.html\">TIGER/Line Shapefiles</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from the <a href=\"https://api.census.gov/\">Census API</a>.</p>"
      }
    ]
  },
  {
    "state": "New Mexico",
    "code": "NM",
    "modules": [
      {"name": "Statewide", "id": "new_mexico", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["new_mexico"],
        "content": "<p>The units you see here are <strong>precincts</strong>.</p><p>The New Mexico precinct shapefile was obtained from the New Mexico <a href=\"http://rgis.unm.edu/rgis6/\">Resource Geographic Information System (RGIS)</a>, which is managed by the Earth Data Analysis Center (EDAC) at the University of New Mexico. It was processed by members of the Metric Geometry and Gerrymandering Group (MGGG).</p><p>The Congressional, State Senate and State House district map shape files, as well as the 2010 census block shape file are from the <a href=\"https://www.census.gov/geographies/mapping-files/time-series/geo/tiger-line-file.html\">US Census Bureau's TIGER/Line Program</a>. </p><p>Precint level elections returns were provided by the <a href=\"https://www.sos.state.nm.us/voting-and-elections/election-results/past-election-results-2018/\">New Mexico Secretary of State's</a> website. Block level demographic data is from the Census API.</p><p>Statewide election returns from 2016 and 2018 - from the New Mexico Secretary of State - were cleaned by MGGG staff in order to join it with the New Mexico precinct shapefile. Census block data was aggregated to the precinct level using MGGG's <a href=\"https://github.com/mggg/maup\">proration software</a>."
      }
    ]
  },
  {
    "state": "New York",
    "code": "NY",
    "modules": [
      {"name": "Islip", "id": "islip", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["newyork"],
        "content": "<p>The units used here are <strong>census block groups</strong>. Data for this module were obtained from the US Census Bureau. The block group shapefile for New York was downloaded from the Census's <a href=\"https://www.census.gov/geo/maps-data/data/tiger-line.html\">TIGER/Line Shapefiles</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from the <a href=\"https://api.census.gov/\">Census API</a>.</p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["islip"],
        "content": "<p>The units you see here are <strong>census blocks</strong>. Data for this module were obtained from the US Census Bureau. The block shapefile for the City of Islip was downloaded from the Census <a href=\"https://www.census.gov/geo/maps-data/data/tiger-line.html\">TIGER/Line Shapefiles</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from <a href=\"https://factfinder.census.gov/faces/nav/jsf/pages/index.xhtml\">American FactFinder</a>. The source shapefile with demographic information is available for download from MGGG's GitHub organization <a href=\"https://github.com/gerrymandr/Districtr-Prep/tree/master/Islip\">@gerrymandr</a>.</p>"
      }
    ]
  },
  {
    "state": "North Carolina",
    "code": "NC",
    "modules": [
      {"name": "Statewide", "id": "nc", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "Districts in North Carolina",
        "nav": "Districts",
        "pages": ["nc"],
        "type": "text",
        "content": "<p>North Carolina currently has 13 Congressional seats, a 50 member State Senate, and a 120 member State House. Representatives are elected from single member districts. </p>"
      },
      {
        "name": "Redistricting rules in North Carolina",
        "nav": "Rules",
        "type": "text",
        "content": "<p>Like all states in the US, North Carolina must comply with Constitutional equal population requirements and the Voting Rights Act. There are no additional requirements for Congressional districts, but North Carolina state and case law establishes the following additional criteria for state legislative districts:<ul><li>Districts must be contiguous. They cannot be only touching at a point.</li><li>Districts must be compact.</li><li>Districts should attempt to keep communities of interest intact.</li><li>Districts should preserve county lines as much as possible. When counties are grouped, districts should include as few counties as possible.</li><li>Districts must not be drawn for the purpose of favoring a political party </li></ul>  The state legislature draws districts for both congress and the state legislature. They are not subject to veto by the governor. </p>"
      },
      {
        "name": "Rucho v. Common Cause",
        "nav": "In the Court",
        "type": "text",
        "pages": ["nc"],
        "content": "<p>In March 2019 the US Supreme Court heard oral arguments for Rucho v. Common Cause, in which plaintiffs claim that North Carolina's remedial 2016 congressional map is an unconstitutional partisan gerrymander. The 2016 remedial map had been drawn after the Supreme Court struck down two of the state's 2011 enacted congressional districts as unconstitutional racial gerrymanders. MGGG and our collaborators filed an amicus brief which can be accessed <a href=\"https://mggg.org/amicus\">on our website</a>.</p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["nc"],
        "content": "<p>The units used here are <strong>voting tabulation districts</strong> or VTDS. Data for this module were obtained from the North Carolina General Assembly and National Historic GIS (NHGIS). The VTD shapefile and election results were downloaded from the North Carolina General Assembly's <a href=\"https://www.ncleg.gov/RnR/Redistricting/BaseData2016\">2016 Redistricting Reference Data</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from <a href=\"https://www.nhgis.org\">NHGIS</a>. The source shapefile for this module, along with additional information about processing, is available for download from MGGG's GitHub organization <a href=\"https://github.com/mggg-states/NC-shapefiles\">@mggg-states</a>.</p>"
      }
    ]
  },
  {
    "state": "Ohio",
    "code": "OH",
    "modules": [
      {"name": "Statewide", "id": "ohio", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["ohio"],
        "content": "<p>The units you see here are <strong>precincts</strong>.</p><p>This shapefile was compiled and processed by members of the Voting Rights Data Institute (VRDI) and the Metric Geometry and Gerrymandering Group (MGGG). VRDI was a 2018 summer intensive sponsored by MGGG at Tufts and MIT, with major support from a Bose Research Grant at MIT and from the Jonathon M. Tisch College of Civic Life at Tufts.</p><p>Raw data for Ohio's precinct boundaries was sourced from election and other county officials and processed by members of MGGG and students at VRDI. For more information on the sourcing of this data, please refer to the Metric Geometry and Gerrymandering Group's <a href=\"https://github.com/mggg/ohio-precincts\">Ohio Precincts Github repository</a>. Election data come the <a href=\"https://www.sos.state.oh.us/elections/election-results-and-data/2016-official-elections-results/\">Ohio Secretary of State</a> and the <a href=\"https://electionlab.mit.edu/\">MIT Election Data Science Lab</a>. Demographic data were downloaded at the census block level from <a href=\"https://www.nhgis.org/\">IPUMS NHGIS</a>.</p><p>Demographic data were aggregated from the block level using MGGG’s proration software <a href=\"https://github.com/mggg/maup\">maup</a>. Congressional, house, and senate district IDs were assigned to precincts also using this package.</p>"
      }
    ]
  },
  {
    "state": "Oklahoma",
    "code": "OK",
    "modules": [
      {"name": "Statewide", "id": "oklahoma", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["oklahoma"],
        "content": "<p>The units you see here are <strong>precincts</strong>.</p><p>This shapefile comes from the University of Oklahoma's Center for Spatial Analysis and processed by members of the Metric Geometry and Gerrymandering Group (MGGG).</p><p>This precinct shapefile was obtained from the <a href=\"https://data.csa.ou.edu/\">Oklahoma Data Warehouse</a> hosted by the Center for Spatial Analysis at the University of Oklahoma. Election results come from the <a href=\"https://www.ok.gov/elections/Election_Info/Election_Results/2018-Election_Results.html\">Oklahoma State Election Board</a>. 2010 Decennial Census demographic data were downloaded from the <a href=\"https://api.census.gov/data/2010/dec/sf1\">Census API</a>. The 2010 census block shapefile as well as congressional and state legislative districts for Oklahoma were downloaded from the US Census Bureau’s <a href=\"https://www.census.gov/geographies/mapping-files/time-series/geo/tiger-line-file.html\">TIGER/Line Shapefiles</a>.</p><p>Oklahoma reports absentee and early votes at the precinct level for every county except for Oklahoma County and Tulsa County, where non-election day votes are reported for the whole county. For those two counties, absentee and early votes were disaggregated to the precinct level by population. Demographic data were aggregated from the block level and precincts were assigned to congressional and state legislative districts using <a href=\"https://github.com/mggg/maup\">MGGG’s proration software</a>. Precincts for Pushmataha County were digitized to conform to a map provided by the county.</p>"
      }
    ]
  },
  {
    "state": "Oregon",
    "code": "OR",
    "modules": [
      {"name": "Statewide", "id": "oregon", "default": "true"},
      {"name": "Portland", "id": "portlandor"},
      {"name": "Salem-Keizer Schools", "id": "salem_keizer"}
    ],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "Districts in Oregon",
        "nav": "Districts",
        "pages": ["oregon"],
        "type": "text",
        "content": "<p>Oregon currently has 5 Congressional seats, and is projected to gain a 6th after the 2020 census.  The Oregon Legislative Assembly has 30 members in the State Senate, and 60 members in the State House, where each representative is elected from a single member districts.  Additionally in Oregon, Legislative Assembly districts are nested, where each Senate districts is comprised of two adjacent House districts.</p>"
      },
      {
        "name": "Portland City Council",
        "nav": "City Council",
        "pages": ["portlandor"],
        "type": "text",
        "content": "<p>The City Council in Portland currently consists of 5 members (including the mayor).  City council members (commissioners) are elected at-large in nonpartisan elections.</p>"
      },
      {
        "name": "Redistricting rules in Oregon",
        "nav": "Rules",
        "pages": ["oregon"],
        "type": "text",
        "content": "<p>Like all states in the US, Oregon must comply with Constitutional equal population requirements and the Voting Rights Act. In addition, Oregon Law, asks that districts should <i>\"as nearly as practicable\"</i> meet the following criteria:<ul><li>Districts must be contiguous.</li><li>Districts should utilize existing geographic or political boundaries.</li><li>Districts should not divide communities of common interest.</li><li>Districts should be connected by transportation links.</li><li>Districts must not be drawn for the purpose of favoring a political party, incumbent, or other person.</li></ul>  Currently in Oregon districts are drawn by the State Legislature and subject to veto by the governor. </p>"
      },
      {
        "name": "Explore the currently enacted plans",
        "nav": "Enacted Plans",
        "pages": ["oregon"],
        "type": "plans",
        "ref": "oregon",
        "disc": "Click on any of the districting plans below to open it in Districtr. Then feel free to start modifying it yourself!",
        "plans": [
          {
            "title": "Enacted Plans",
            "plans": [
              {
                "id": "enacted-congressional",
                "name": "Congressional Plan"
              },
              {
                "id": "enacted-senate",
                "name": "State Senate Plan"
              },
              {
                "id": "enacted-house",
                "name": "State House Plan"
              }
            ]
          }
        ]
      },
      {
        "name": "Election reform in Oregon",
        "nav": "Reform",
        "pages": ["oregon"],
        "type": "text",
        "content": "<p><a href=\"https://www.peoplenotpoliticiansoregon.com/\">People not Politicians</a> filled Ballot Measures in Oregon that would create an independent citizen redistricting commission if passed in November 2020.</p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "pages": ["oregon", "portlandor"],
        "type": "text",
        "content": "<p>The units in these modules are <strong>precincts</strong>.</p><p>This shapefile was compiled by Kevin Rancik with the help of Steve Gerontakis and was used by The Oregonian. It was processed and verified by members of the Metric Geometry and Gerrymandering Group.</p><p>The Oregon precinct shapefile was obtained from <a href=\"http://www.kevinrancik.com/elections/Oregon/eOregon.html\">Kevin Rancik's personal website</a>. Rancik and Gerontakis obtained the raw county-level precinct boundaries from local county elections offices and county clerks, documented in detail <a href=\"http://www.kevinrancik.com/elections/Oregon/e2018_11/E2018_Oregon_Metadata.pdf\">here</a>. Election results for 2016 and 2018 were obtained from the <a href=\"https://electionlab.mit.edu\">MIT Election Data and Science Lab (MEDSL)</a>. 2010 Decennial Census demographic data were downloaded from the <a href=\"https://api.census.gov/data/2010/dec/sf1\">Census API</a>. The 2010 census block shapefile for Oregon along with congressional and state legislative districts were downloaded from the US Census Bureau’s <a href=\"https://www.census.gov/geographies/mapping-files/time-series/geo/tiger-line-file.html\">TIGER/Line Shapefiles</a>.</p><p>Precinct election returns were cleaned by MGGG staff in order to join them to the precinct shapefile. Certain precincts in the shapefile and in the results were merged in order to reconcile discrepencies. Demographic data was aggregated from the block level using <a href=\"https://github.com/mggg/maup\">MGGG’s proration software</a>. Congressional and state legislative district IDs were assigned to precincts also using this package.</p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "pages": ["salem_keizer"],
        "type": "text",
        "content": "<p>The units you see here are <strong>Census blocks</strong>.  Data for this module were obtained from the US Census Bureau. The block shapefile for the Salem-Keizer Unified School District was downloaded from the Census TIGER/Line Shapefiles. Demographic information from the 2010 Decennial Census was downloaded at the block level from IPUMS NHGIS, University of Minnesota, <a href=\"http://www.nhgis.org\">www.nhgis.org</a>.</p>"
      }
    ]
  },
  {
    "state": "Pennsylvania",
    "code": "PA",
    "modules": [
      {"name": "Statewide", "id": "pennsylvania", "default": "true"},
      {"name": "Philadelphia", "id": "philadelphia"}
    ],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "Redistricting in the court",
        "nav": "In the Court",
        "type": "text",
        "pages": ["pennsylvania"],
        "content": "<p>In February 2018, Moon Duchin was asked by Governor Tom Wolf to provide guidance in evaluating redistricting plans for fairness after the Pennsylvania Supreme Court struck down the 2011 enacted plan as an unconstitutional partisan gerrymander. Her report is hosted on <a href=\"https://mggg.org/uploads/md-report.pdf\">MGGG's website</a>.</p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["pennsylvania"],
        "content": "<p>The units used here are <strong>voting tabulation districts</strong>, or VTDs. The raw, unprocessed VTDs were collected from the Census <a href=\"https://www.census.gov/geo/maps-data/data/tiger-line.html\">TIGER/Line Shapefiles</a>. Election data was compiled at the precinct level by a private individual and was found to be within 1% of the official state-reported results at the county and state levels. Demographic information from the 2010 Decennial Census was downloaded at the block level from <a href=\"https://factfinder.census.gov/faces/nav/jsf/pages/index.xhtml\">American FactFinder</a>. The source shapefile for this module, along with additional information about processing, is available for download from MGGG's GitHub organization <a href=\"https://github.com/mggg-states/PA-shapefiles\">@mggg-states</a>.</p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["philadelphia"],
        "content": "<p>The units you see here are <strong>census blocks</strong>. Data for this module were obtained from the US Census Bureau. The block shapefile for the City of Philadelphia was downloaded from the Census <a href=\"https://www.census.gov/geo/maps-data/data/tiger-line.html\">TIGER/Line Shapefiles</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from <a href=\"https://factfinder.census.gov/faces/nav/jsf/pages/index.xhtml\">American FactFinder</a>.</p>"
      }
    ]
  },
  {
    "state": "Rhode Island",
    "code": "RI",
    "modules": [
      {"name": "Statewide", "id": "rhode_island", "default": "true"},
      {"name": "Providence", "id": "providence_ri"}
    ],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "Districts in Rhode Island",
        "nav": "Districts",
        "type": "text",
        "pages": ["rhode_island"],
        "content": "<p>Rhode Island has 2 Congressional seats, 75 State House seats, and state Senate seats. The state legislature is responsible for drawing federal and state districts, but the governor has veto power over districting plans. There is also an advisory commission tasked with recommending congressional and state legislative plans to the legislature. There are 18 members in the commission: 7 chosen by each the state Senate and state House majority leaders of whom 4 are legislature members and 3 are not and 2 members chosen by each the state Senate and state House minority leaders, of whom all are members of the legislature. The advisory commission is tasked with conducting public hearings before finalizing a district plan recommendation to the legislature. State law states that any software used for redistricting must be made available for public access.</p>"
      },
      {
        "name": "Redistricting Rules in Rhode Island",
        "nav": "Rules",
        "type": "text",
        "pages": ["rhode_island"],
        "content": "<p>The Rhode Island state Constitution requires that state legislative districts be as compact as possible, but this does not extend to congressional districts. The state has additional criteria for both state legislative and congressional districts that are subject to modification by the state legislature as deemed necessary. Current laws for Rhode Island request that districts:<ul><li>Be as contiguous as possible</li><li>Be as equal in population as possible</li><li>Reflect natural, historical, geographical and municipal and other political lines</li><li>Preserve \"the right of all Rhode Islanders to fair representation and equal access to the political process.\"</li><li>Coincide for the state House, state Senate, and United States Congress (with the stipulation that if districts do not align perfectly that they should avoid precincts with fewer than 100 people having distinct ballot options.)</li></ul></p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["rhode_island"],
        "content": "<p>This shapefile was obtained from the Rhode Island GIS Data Distribution System and processed by members of the Metric Geometry and Gerrymandering Group (MGGG). The precinct shapefile came from the Rhode Island Department of State through the <a href=\"http://www.rigis.org\">Rhode Island GIS Data Distribution System</a>. 2010 Decennial Census demographic data were downloaded from the <a href=\"https://api.census.gov/data/2010/dec/sf1\">Census API</a>. The 2010 census block shapefile for Rhode Island was downloaded from the US Census Bureau’s <a href=\"https://www.census.gov/geographies/mapping-files/time-series/geo/tiger-line-file.html\">TIGER/Line Shapefiles</a>. Election data were downloaded from the <a href=\"http://www.elections.ri.gov/elections/preresults/\">Rhode Island Board of Elections</a>.</p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["providence_ri"],
        "content": "<p>The units you see here are <strong>census blocks</strong>. Data for this module were obtained from the US Census Bureau. The block shapefile for the City of Providence was downloaded from the Census <a href=\"https://www.census.gov/geo/maps-data/data/tiger-line.html\">TIGER/Line Shapefiles</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from <a href=\"https://factfinder.census.gov/faces/nav/jsf/pages/index.xhtml\">American FactFinder</a>.</p>"
      }
    ]
  },
  {
    "state": "Texas",
    "code": "TX",
    "modules": [
      {"name": "Statewide", "id": "texas", "default": "true"},
      {"name": "Austin", "id": "austin"}
    ],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["texas"],
        "content": "<p>The units used here are <strong>voting tabulation districts</strong> or VTDS. Data for this module were obtained from the Texas Legislative Council. The VTD shapefile and election results were downloaded from the Texas Legislative Council's <a href=\"https://tlc.texas.gov/redist/data/data.html\">Texas Redistricting website</a>. Demographic data were compiled by the Texas Legislative Council using 2010 Decennial Census data. The source shapefile for this module, along with additional information about processing, is available for download from MGGG's GitHub organization <a href=\"https://github.com/mggg-states/TX-shapefiles\">@mggg-states</a>.</p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["austin"],
        "content": "<p>The units you see here are <strong>census blocks</strong>. Data for this module were obtained from the US Census Bureau. The block shapefile for the City of Austin was downloaded from the Census <a href=\"https://www.census.gov/geo/maps-data/data/tiger-line.html\">TIGER/Line Shapefiles</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from <a href=\"https://factfinder.census.gov/faces/nav/jsf/pages/index.xhtml\">American FactFinder</a>. The source shapefile with demographic information is available for download from MGGG's GitHub organization <a href=\"https://github.com/gerrymandr/Districtr-Prep/tree/master/Austin\">@gerrymandr</a>.</p>"
      }
    ]
  },
  {
    "state": "Utah",
    "code": "UT",
    "modules": [
      {"name": "Statewide", "id": "utah", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "Independent Commission",
        "nav": "Independent Commission",
        "type": "text",
        "pages": ["utah"],
        "content": "<p>In November 2018, Utah narrowly passed Proposition 4, a ballot initiative which shifted the responsibility of redistricting for Utah's state legislative and congressional districts from the state legislature to an independent commission. </p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["utah"],
        "content": "<p>The units you see here are <strong>voting precincts</strong>. Data for this module were obtained from the Utah Automated Geographic Reference Center (AGRC), the MIT Elections Data and Science Lab (MEDSL), and National Historic GIS (NHGIS). The precinct shapefile was downloaded from <a href=\"https://gis.utah.gov/data/political/voter-precincts\">the Utah AGRC</a> and 2016 election results were downloaded from the <a href=\"https://github.com/MEDSL/official-precinct-returns\">MEDSL</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from <a href=\"https://www.nhgis.org\">NHGIS</a>. The source shapefile for this module, along with additional information about processing, is available for download from MGGG's GitHub organization <a href=\"https://github.com/mggg-states/UT-shapefiles\">@mggg-states</a>.</p>"
      }
    ]
  },
  {
    "state": "Vermont",
    "code": "VT",
    "modules": [
      {"name": "Statewide", "id": "vermont", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["vermont"],
        "content": "<p>The units you see here are <strong>towns</strong>. Data for this module were obtained from the Vermont Open Geodata Portal, the Vermont Secretary of State, and the US Census Bureau. The town shapefile was downloaded from the <a href=\"http://geodata.vermont.gov/datasets/vt-data-town-boundaries\">Vermont Open Geodata Portal</a> and election results were downloaded from <a href=\"https://www.sec.state.vt.us/elections/election-results.aspx\">the Secretary of State's website</a>. Vermont does not release election results for towns with a total population under 50, thus 9 towns have been excluded from this module. Demographic information from the 2010 Decennial Census was downloaded at the sub-county level from <a href=\"https://factfinder.census.gov/faces/nav/jsf/pages/index.xhtml\">American FactFinder</a>. The source shapefile for this module, along with additional information about processing, is available for download from MGGG's GitHub organization <a href=\"https://github.com/mggg-states/VT-shapefiles\">@mggg-states</a>.</p>"
      }
    ]
  },
  {
    "state": "Virginia",
    "code": "VA",
    "modules": [
      {"name": "Statewide", "id": "virginia", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "Districts in Virginia",
        "nav": "Districts",
        "type": "text",
        "pages": ["virginia"],
        "content": "<p>Virginia has 11 Congressional districts for the US House of Representatives. The General Assembly of the State of Virginia consists of a House of Delegates with 100 members and a Senate with 40 members.</p>"
      },
      {
        "name": "Redistricting rules in Virginia",
        "nav": "Rules",
        "type": "text",
        "pages": ["virginia"],
        "content": "<h3>Who draws the lines?</h3><p>These legislators commission and approve Virginia’s electoral boundaries, but the governor has veto power. However, this process is often partisanly skewed. Virginia has faced several gerrymandering lawsuits since its last redistricting cycle in 2011.</p><h3>Rules and criteria</h3><p>The Virginia Constitution requires that districts be: <i>contiguous</i> and <i>compact</i>.</p><p>In 2011, the legislative redistricting committees and the Governor set forth additional non-binding guidelines for the following criteria: <ul><li>Population deviation in legislative districts must not exceed 1% from ideal size in House of Delegates districts and 2% in Senate districts</li><li>Districts should respect the boundary lines of existing political subdivisions</li><li>Communities of interest should be preserved and not divided when drawing districts</li><ul><li><i>Note – a community of interest was defined as an area tied together by factors including: economic, social, and/or cultural factors, geographic features, governmental jurisdictions and service delivery areas, political beliefs, voting trends, and incumbency considerations.</i></li></ul></ul></p>"
      },
      {
        "name": "Redistricting in the court",
        "nav": "In the Court",
        "type": "text",
        "pages": ["virginia"],
        "content": "<h3>Voting Rights Act</h3><p>Around 20% of the population of Virginia is Black, making the Voting Rights Act of 1965 requirement that minority groups have the ability to elect their chosen candidate where possible an important consideration in redistricting.</p><h3>Personhuballah v. Alcorn</h3><p>This case was filed in 2013 to challenge a racial gerrymander in a Congressional district in Virginia. In 2014, a district court ruled in favor of the plaintiff, finding that the district was unconstitutionally drawn as a racial gerrymander. However in 2015 the United States Supreme Court vacated this decision. Again later in 2015, the district court ruled in favor of the plaintiff. This ruling held, as the Supreme Court refused to hear an appeal. An outside expert was commissioned to redraw the districts to remedy the gerrymander, and a new plan was approved in 2016.</p><h3>Vesilind v. Va. State Board of Elections</h3><p>This case was filed in 2015 by a group of voters in a state court to challenge the state’s districting plan for violating the state constitution’s requirement of district compactness and contiguity. The court ruled the districts constitutionally valid in 2017. Virginia Supreme Court upheld this ruling upon appeal. From this case, it is acknowledged that the state Assembly may define its own constitutional threshold for compactness.</p><h3>Bethune-Hill v. Virginia Board of Elections</h3><p>This case was filed in 2014 by Virginia residents, challenging 12 State House districts as racial gerrymanders. The litigation is ongoing as of 2019. In 2015 a district court ruled that the district was not unconstitutional in being drawn with race as the primary consideration because the parameter used, a 55% Black Voting Age Population, was justified by the VRA due to highly racially polarized voting in the area of concern. This rationale was determined for one district in particular, but applied to all 12 covered by the case. The Supreme Court upheld the rationale for the original district, but not for the remaining 11 in their 2017 review of the case. In 2018 the district court amended their ruling and decided that the remaining 11 districts were in fact racial gerrymanders, initiating a redistricting process. In early 2019 a new map was approved, but was subsequently sent to the Supreme Court for appeal.</p>"
      },
      {
        "name": "See the enacted plans over the decade",
        "nav": "Plans",
        "pages": ["virginia"],
        "type": "plans",
        "ref": "virginia",
        "disc": "Click on any of the districting plans below to open it in Districtr. Then feel free to start modifying it yourself!",
        "plans": [
          {
            "title": "2011-12 Enacted Plans",
            "plans": [
              {
                "id": "cong_2012",
                "name": "2012 Enacted Congressional Plan"
              },
              {
                "id": "state_sen",
                "name": "2011 Enacted State Senate Plan"
              },
              {
                "id": "house_2011",
                "name": "2011 Enacted State Senate Plan"
              }
            ]
          },
          {
            "title": "Remedial Plans",
            "plans": [
              {
                "id": "cong_2016",
                "name": "2016 Remedial Congressional Plan"
              },
              {
                "id": "house_2019_rem",
                "name": "2019 Remedial State House Plan"
              }
            ]
          }
        ]
      },
      {
        "name": "Research Context",
        "nav": "Research",
        "type": "text",
        "pages": ["virginia"],
        "content": "<p>In June 2018, the Eastern District Court of Virginia ruled 11 of the House of Delegates districts unconstitutional racial gerrymanders. <a href=\"https://mggg.org/VA-report.pdf\">MGGG published a report</a> evaluating the 2011 Enacted House of Delegates plan as well as several of the proposed alternatives as well as a <a href=\"https://mggg.org/VA-criteria.pdf\">report assessing the potential impacts of the proposed constitutional amendment</a> for redistricting in Virginia, particularly the proposed rules for constraints and priorities in drawing districts.</p>"
      },
      {
        "name": "Reform efforts",
        "nav": "Reform",
        "type": "text",
        "pages": ["virginia"],
        "content": "<p>A state constitutional amendment is currently underway that would create a new bipartisan commission to oversee the drawing and approval of new congressional and legislative districts. The amendment would require redistricting plans to: <ul><li>\"Preserve opportunity to elect candidates of choice for 'substantial racial or ethnic minority communities'\"</li><li>\"Form districts to be compact and contiguous.\"</li></ul>The amendment passed through the General Assembly twice, and is will be a referendum on the November 2020 ballot.</p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["virginia"],
        "content": "<p>The units you see here are <strong>voting precincts</strong>. Data for this module were obtained from the Princeton Gerrymandering Project and National Historic GIS (NHGIS). The precinct shapefile was compiled and joined to election results by the <a href=\"https://github.com/PrincetonUniversity/VA-gerrymander/tree/master/Maps/VA%20Precincts/Precincts%20with%20CD/Elections\">Princeton Gerrymandering Project</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from <a href=\"https://www.nhgis.org\">NHGIS</a>. The source shapefile for this module, along with additional information about processing, is available for download from MGGG's GitHub organization <a href=\"https://github.com/mggg-states/VA-shapefiles\">@mggg-states</a>.</p>"
      }
    ]
  },
  {
    "state": "Washington",
    "code": "WA",
    "modules": [
      {"name": "Statewide", "id": "washington", "default": "true"},
      {"name": "Yakima County", "id": "yakima_wa"},
      {"name": "King County", "id": "kingcountywa"}
    ],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "The electoral system in Yakima County",
        "nav": "Electoral System",
        "pages": ["yakima_wa"],
        "type": "text",
        "content": "<p>On January 15, 2020, <a href=\"https://weareoneamerica.org\">OneAmerica</a> and <a href=\"https://campaignlegal.org\">Campaign Legal Center (CLC)</a> filed a challenge letter over the current system employed by Yakima County. In it, they argue that the system dilutes the votes of Latinos in Yakima County and is in violation of the Washington Voting Rights Act (WVRA) and the Washington State Constitution.  Read the full letter <a href=\"http://weareoneamerica.org/wp-content/uploads/Yakima-County-notice-letter-1.15.20.pdf\">[here]</a>.</p><p>At first glance, Yakima county seems to already be districted to facilitate minority opportunity to elect candidates of choice. There are three districts; District 1 is mostly White, but District 2 has a slight POC majority, including about 40% Hispanic VAP and an additional 8% Native VAP, while District 3 is 55% Hispanic by VAP.</p><p>This is undercut by an unusual—and very problematic—system of electing County Commissioners. Each district is represented by a Commissioner. The primary election is conducted by a district-wide \"jungle primary,\" in which any number of candidates may run and the top two vote-getters advance to the general election without regard to party affiliation. (In fact, candidates with the \"prefers Republican\" label predominate over all others in Yakima, and this is even true for Hispanic candidates.) But the entire county, and not just the district, then votes to choose a winner between the two finalists. This indicates that the system itself negates any advantage of districting, nullifying the minorities' opportunity to elect.</p><p>Read more about our study of Voting Rights in Yakima and possible remedies in our <a href=\"https://mggg.org/uploads/Yakima.pdf\">report</a>.  Our data is available on our <a href=\"https://github.com/mggg/yakima-data\">github</a>.</p>"
      },
      {
        "name": "See sample plans",
        "nav": "Sample Plans",
        "pages": ["yakima_wa"],
        "type": "plans",
        "ref": "yakima",
        "disc": "Click on any of the districting plans below to open it in Districtr. Then feel free to start modifying it yourself!",
        "plans":
        [
          {
            "title": "Sample valid 3-district plans",
            "plans": [
              {
                "id": "plan_a",
                "name": "Plan A"
              },
              {
                "id": "plan_b",
                "name": "Plan B"
              },
              {
                "id": "plan_c",
                "name": "Plan C"
              }
            ]
          }
        ]
      },
      {
        "name": "About the Data",
        "nav": "Data",
        "type": "text",
        "pages": ["washington"],
        "content": "<p> The units used here are <strong>census block groups</strong>. Data for this  module were obtained from the US Census Bureau. The block group shapefile  for Washington was downloaded from the Census's  <a href=\"https://www.census.gov/geo/maps-data/data/tiger-line.html\">TIGER/Line Shapefiles</a>. Demographic information from the 2010 Decennial Census was downloaded at the block level from the <a href=\"http://api.census.gov/\">Census API</a>.</p>"
      }
    ]
  },
  {
    "state": "Wisconsin",
    "code": "WI",
    "modules": [
      {"name": "Statewide", "id": "wisconsin", "default": "true"}],
    "sections": [
      {
        "name": "Draw a plan from scratch",
        "nav": "Draw",
        "type": "draw"
      },
      {
        "name": "Gill v. Whitford",
        "nav": "In the Court",
        "type": "text",
        "pages": ["wisconsin"],
        "content": "<p>In June 2018, the US Supreme Court remanded back to the lower courts Gill v. Whitford, a case challenging Wisconsin's state assembly districts as an unconstitutional partisan gerrymander.</p>"
      },
      {
        "name": "About the data",
        "nav": "Data",
        "type": "text",
        "pages": ["wisconsin"],
        "content": "<p>The units you see here are <strong>wards</strong>, which are Wisconsin's precinct equivalents. All election data for this module were obtained <a href=\"https://data-ltsb.opendata.arcgis.com\">from the Wisconsin State Legislature</a>. The source shapefile for this module, along with additional information about processing, is available for download from MGGG's GitHub organization <a href=\"https://github.com/mggg-states/WI-shapefiles\">@mggg-states</a>.</p>"
      }
    ]
  }
]